/**
  ******************************************************************************
  * @file    bsp_Init.c
  * @author  Lixf
  * @version V1.0
  * @date    2022-08-27
  * @brief   板级外设初始化
  ******************************************************************************
  * @attention
  *
  * 实验平台:野火  STM32 F429 开发板  
  *
  ******************************************************************************
  */

#include "./Init/bsp_Init.h"
#include "./led/bsp_led.h"
#include "./usart/bsp_debug_usart.h"
#include "./key/bsp_key.h"
#include "./exti/bsp_exti.h"
/*******************************************************************************
* @ 函数名   ：BSP_Init 
* @ 功能说明 ：板级外设初始化，开发板上的所有硬件初始均可放在这个函数里面
* @ 参数     ：无
* @ 返回值   ：无
*******************************************************************************/

void BSP_Init(void)
{
	/*
	* STM32 中断优先级分组为 4，即 4bit 都用来表示抢占优先级，范围为 0~15
	* 优先级分组只需要分组一次即可，以后如果有其他的任务需要用到中断，
	* 都统一用这个优先级分组，不要再分组，切忌
	*/
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_4);
	
	/* LED 初始化 */
	LED_GPIO_Config();
 	Debug_USART_Config();
  Key_GPIO_Config();
	EXTI_Key_Config();
}


