/**
  ******************************************************************************
  * @file    main.c
  * @author  Lixf
  * @version V1.0
  * @date    2022-xx-xx
  * @brief   Huawei_LiteOS
  ******************************************************************************
  * @attention
  *
  * 实验平台:野火  STM32 F429 开发板 
  *
  ******************************************************************************
  */
#include "stm32f4xx.h"

#include "los_sys.h"
#include "los_typedef.h"
#include "los_task.ph"


/**
  * @brief  主函数
  * @param  无
  * @retval 无
  */
int main(void)
{
	
}

/*********************************************END OF FILE**********************/

